In [1]:
people = {
    "first":["Praveena", "Chandrika", "srilekha", "Vijaya" ,"Sravani", "Madhavi"],
    "last":["Bhimani", "Tirumala", "Yeruva", "Arikatla", "Kalluri", "Papasani"],
    "roll":[19,178,193,9,74,134]
}

In [2]:
people['first']

['Praveena', 'Chandrika', 'srilekha', 'Vijaya', 'Sravani', 'Madhavi']

In [3]:
import pandas as pd

In [4]:
df = pd.DataFrame(people)

In [5]:
df

       first      last  roll
0   Praveena   Bhimani    19
1  Chandrika  Tirumala   178
2   srilekha    Yeruva   193
3     Vijaya  Arikatla     9
4    Sravani   Kalluri    74
5    Madhavi  Papasani   134

In [6]:
df['roll']

0     19
1    178
2    193
3      9
4     74
5    134
Name: roll, dtype: int64

In [9]:
df.roll

0     19
1    178
2    193
3      9
4     74
5    134
Name: roll, dtype: int64

In [15]:
type(df['roll']) 
# series is rows of single column, dataframe is a container for multiple series objects

In [14]:
type(people['roll'])

In [13]:
df.count

In [12]:
df[['first','last']]

       first      last
0   Praveena   Bhimani
1  Chandrika  Tirumala
2   srilekha    Yeruva
3     Vijaya  Arikatla
4    Sravani   Kalluri
5    Madhavi  Papasani

In [16]:
df.columns

Index(['first', 'last', 'roll'], dtype='object')

In [21]:
df.iloc[0]

first    Praveena
last      Bhimani
roll           19
Name: 0, dtype: object

In [22]:
df.iloc[[0,1,4]]

       first      last  roll
0   Praveena   Bhimani    19
1  Chandrika  Tirumala   178
4    Sravani   Kalluri    74

In [31]:
df.iloc[[0,1],[0,2]]

       first  roll
0   Praveena    19
1  Chandrika   178

In [32]:
df

       first      last  roll
0   Praveena   Bhimani    19
1  Chandrika  Tirumala   178
2   srilekha    Yeruva   193
3     Vijaya  Arikatla     9
4    Sravani   Kalluri    74
5    Madhavi  Papasani   134

In [33]:
df.loc[0]

first    Praveena
last      Bhimani
roll           19
Name: 0, dtype: object

In [34]:
df.loc[[0,2]]

      first     last  roll
0  Praveena  Bhimani    19
2  srilekha   Yeruva   193

In [39]:
df.loc[[0],'roll']

0    19
Name: roll, dtype: int64